Repository: ZtupidTS/thesnow
Catalog: Code/CPP/PCSX2/locales/*/pcsx2_Tertiary.po
Languages: de_de

source: No reason given.
de_de: Kein Grund angegeben.

source: Threading activity: start, detach, sync, deletion, etc.
de_de: Threading Aktivität.

source: Includes idle event processing and some other uncommon event usages.
de_de: Idle Zeit und Anderes.

source: The MTGS thread has become unresponsive while waiting for the GS plugin to open.
de_de: Der MTGS Thread ist eingefroren.

source: Internal Memorycard Plugin failed to initialize.
de_de: Internes Memory Card Plugin konnte nicht Initialisiert werden.

source: Safest
de_de: Sicher

source: Safe (faster)
de_de: Sicher (schneller)

source: Balanced
de_de: Ausbalanciert

source: Aggressive
de_de: Aggressiv

source: Aggressive plus
de_de: Aggressiv Plus

source: Mostly Harmful
de_de: Maximum

source: Fits a lot of log in a microcosmically small area.
de_de: Packt viel Info in ein kleines Fenster.

source: It's what I use (the programmer guy).
de_de: Das, was ich auch nutze (der Programmierer).

source: Its nice and readable.
de_de: Nett und lesbar.

source: In case you have a really high res display.
de_de: Für Riesendisplays.

source: Default soft-tone color scheme.
de_de: Standard Farbschema.

source: Classic black color scheme for people who enjoy having text seared into their optic nerves.
de_de: Klassisch tiefschwarz :)

source: When checked the log window will be visible over other foreground windows.
de_de: Hält das Logfenster im Vordergrund.

source: !ContextTip:ChangingNTFS
de_de: Die NTFS Komprimierung kann jederzeit via Windows Explorer geändert werden.

source: Always use this option if you want the safest and surest memory card behavior.
de_de: Nutze diese Option, um die sichersten Memory Cards zu Erstellen.

source: 16 and 32 MB cards have roughly the same compatibility factor.
de_de: 16 und 32MB Karten sind gleich gut kompatibel.

source: Use at your own risk. Erratic memory card behavior is possible (though unlikely).
de_de: Auf eigenes Riskio benutzen. Fehlerhaftes Memory Card Verhalten ist möglich (aber unwahrscheinlich).

source: !ContextTip:Folders:Settings
de_de: PCSX2 und Plugins werden versuchen ihre Einstellungen in diesen Ordner zu schreiben. Einige (ältere) Plugins könnten dies jedoch nicht unterstützen.

source: !Panel:HasHacksOverrides
de_de: Achtung! PCSX2 läuft mit Kommandozeilenparametern, welche die hier zu tätigenden Einstellungen übergehen. Solltest du hier Änderungen vornehmen, werden diese Kommandozeilenparameter ignoriert.

source: !Panel:HasPluginsOverrides
de_de: Achtung! PCSX2 läuft mit Kommandozeilenparametern, welche die hier einzustellenden Plugins und Ordner übergehen. Solltest du hier Änderungen vornehmen, werden diese Kommandozeilenparameter ignoriert.

source: !Notice:Tooltip:Presets:Slider
de_de: Preset info: 1 - Akkurat aber langsam 3 - Balance zwischen Geschwindigkeit und Kompatibilität 4 - Etwas aggressivere Hacks 6 - Viele Hacks, wird Spiele verlangsamen

source: !Notice:Tooltip:Presets:Checkbox
de_de: Presets erleichtern dir die Konfiguration, indem sie passende Einstellungen zur gewünschten Geschwindigkeitsstufe wählen. Höhere Stufen aktivieren mehr Hacks und sind daher nicht mit allen Spielen kompatibel.

source: Logs events as they are passed to the PS2 virtual machine.
de_de: Loggt Ereignisse, die der PS2 Virtual Machine übergeben werden.

source: !ContextTip:DirPicker:UseDefault
de_de: Nutzt das Standardverzeichnis des gewählten Installationsmodus.

source: !ContextTip:Window:Vsync
de_de: VSync ist eine Grafikoption, die versucht Jidder und Tearing zu vermeiden. Sie setzt voraus, dass das Spiel mit voller Geschwindigkeit läuft, was selten zu 100% der Fall ist. Es wird nicht empfohlen, VSync zu aktivieren.

source: !ContextTip:Window:ManagedVsync
de_de: Aktiviert Vsync nur bei voller Geschwindigkeit. Sobald die FPS unter 50 (PAL) oder 60 (NTSC) fallen, wird Vsync deaktiviert.

source: !ContextTip:Window:HideMouse
de_de: Versteckt den Mauscursor.

source: !ContextTip:Window:Fullscreen
de_de: Kann auch während der Emulation mit ALT+ENTER erreicht werden.

source: !ContextTip:Window:HideGS
de_de: Versteckt das GS Fenster wenn man mit ESC die Emulation pausiert.

source: !ContextTip:Gamefixes:EE Timing Hack
de_de: Ändert das wichtige Timing für alle DMA Komponenten auf einen festen, schnellen Wert. Hat diversen Einfluss auf die Kompatibilität.

source: !ContextTip:Gamefixes:OPH Flag hack
de_de: Veraltet

source: !ContextTip:Folders:Savestates
de_de: In diesen Ordner wird PCSX2 versuchen Savestates zu schreiben. States können bei vielen Spielen schnell recht viel Platz beanspruchen!

source: !ContextTip:Folders:Snapshots
de_de: In diesen Ordner werden PCSX2 und Plugins versuchen Screenshots zu schreiben.

source: !ContextTip:Folders:Logs
de_de: In diesen Ordner werden PCSX2 und Plugins versuchen Logdateien zu schreiben.

source: !Panel:Speedhacks:EECycleX1
de_de: Deaktiviert

source: !Panel:Speedhacks:EECycleX2
de_de: Stufe 2.

source: !Panel:Speedhacks:EECycleX3
de_de: Stufe 3.

source: !Panel:Speedhacks:VUCycleStealOff
de_de: Kein Cycle Steal.

source: !Panel:Speedhacks:VUCycleSteal1
de_de: Stufe 1.

source: !Panel:Speedhacks:VUCycleSteal2
de_de: Stufe 2.

source: !Panel:Speedhacks:VUCycleSteal3
de_de: Stufe 3.

source: !ContextTip:Speedhacks:EECycleRate Slider
de_de: Erhöhen dieses Wertes untertaktet die virtuelle PS2 CPU (Emotion Engine). Daher läuft die Emulation etwas schneller aber viele Spiele laufen stockend.

source: !ContextTip:Speedhacks:VUCycleStealing Slider
de_de: "Stiehlt" der PS2 CPU einige Zyklen bei jeder VU Programmausführung. Geschwindigkeitsgewinn bei reduzierter Kompatibilität.

source: !ContextTip:Speedhacks:vuFlagHack
de_de: Lässt einige VU Statusflags aus. Sicher.

source: !ContextTip:Speedhacks:vuBlockHack
de_de: Kann die Geschwindigkeit leicht erhöhen. In FFX kontraproduktiv!

source: !ContextTip:Speedhacks:vuMinMax
de_de: Funktioniert nicht mit Gran Turismo 4 oder Tekken 5.

source: !ContextTip:Speedhacks:INTC
de_de: Kann gefahrlos aktiviert werden.

source: !ContextTip:Speedhacks:BIFC0
de_de: Kann gefahrlos aktiviert werden.

source: !ContextTip:Speedhacks:fastCDVD
de_de: Einige Spiele erwarten ein standardkonformes (langsam lesendes) DVD Laufwerk. Diese können dann hängenbleiben.

source: !ContextTip:Framelimiter:Disable
de_de: Deaktiviert den Framelimiter. Das Spiel läuft so schnell wie es dein Rechner ermöglicht.

source: Error while parsing either NTSC or PAL framerate settings. Settings must be valid floating point numerics.
de_de: Fehler beim Einlesen der NTSC oder PAL Framerateeinstellungen.

source: For troubleshooting potential bugs in the MTGS only, as it is potentially very slow.
de_de: Um eventualle Fehler im MTGS Thread zu debuggen. Sehr langsam!

source: Completely disables all GS plugin activity; ideal for benchmarking EEcore components.
de_de: Deaktiviert alle GS Plugin Aktivitäten. Ideal um den Emulatorkern zu Benchmarken.

source: !ContextTip:GS:SyncMTGS
de_de: Nur für das Debugging aktivieren. Sehr langsam.

source: !ContextTip:GS:DisableOutput
de_de: Entfernt störende Faktoren von der Grafikkarte oder Treiberproblemen. Nur für PCSX2 Benchmarks interressant.
